Autodesk.Revit.DB.ExternalFileReferenceType
Enum class indicating kinds of external file references
Since:
2012
Since:
2012

Autodesk.Revit.DB.ExternalFileReferenceType.AssemblyCodeTable
The assembly code table (The file which contains assembly code information.)

Autodesk.Revit.DB.ExternalFileReferenceType.Material
Materials are not included as ExternalFileReferences in the 2012 release

Autodesk.Revit.DB.ExternalFileReferenceType.Decal
Decals (images which appear only during rendering)

Autodesk.Revit.DB.ExternalFileReferenceType.KeynoteTable
The keynote table (The file which contains keynote information.)

Autodesk.Revit.DB.ExternalFileReferenceType.DWFMarkup
DWF markup files

Autodesk.Revit.DB.ExternalFileReferenceType.CADLink
Linked CAD files

Autodesk.Revit.DB.ExternalFileReferenceType.RevitLink
Revit linked files

Autodesk.Revit.DB.ExternalFileReferenceType.None
Uninitialized value